src/InformationRegisters/СоставДокументовЗарплатаКадры/СоставДокументовЗарплатаКадры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоставДокументовЗарплатаКадры</name>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументФизическогоЛица</name>
    <type>
      <types>DefinedType.ДокументПоФизическомуЛицу</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГоловнойСотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/КадроваяИсторияСотрудниковИнтервальный/КадроваяИсторияСотрудниковИнтервальный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КадроваяИсторияСотрудниковИнтервальный</name>
  <resources>
    <name>ПериодПредыдущейЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.ВидыКадровыхСобытий</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ГоловнойСотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоГоловнойСотрудник</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьПоШтатномуРасписанию</name>
    <type>
      <types>CatalogRef.ШтатноеРасписание</types>
    </type>
  </resources>
  <resources>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровССотрудниками</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>22</precision>
        <scale>20</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РегистраторЗаписи</name>
    <type>
      <types>DefinedType.ДокументыКадровойИстории</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистраторСобытия</name>
    <type>
      <types>DefinedType.ДокументыКадровойИстории</types>
    </type>
  </attributes>
  <attributes>
    <name>ПустойИнтервал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВариантыПодписанияДокументовКЭДО/ВариантыПодписанияДокументовКЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыПодписанияДокументовКЭДО</name>
  <enumValues>
    <name>Требуется</name>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
  </enumValues>
  <enumValues>
    <name>НеобходимаСобственноручнаяПодпись</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/КадровыйЭДОБазовый/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ТипыОбъектовСоСтороннимиПечатнымиФормами() Экспорт
	
	ТипыОбъектов = Новый Массив;
	ТипыОбъектов.Добавить(Тип("ДокументСсылка.Увольнение"));
	
	Возврат ТипыОбъектов;
	
КонецФункции

Процедура ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек) Экспорт
	
	КадровыйЭДО.ДобавитьНастройкуПечатнойФормы(
		ОписанияНастроек,
		Документы.СогласиеНаПрисоединениеККЭДО.ИдентификаторКомандыПечатиЗаявления(),
		НСтр("ru = 'Заявление на согласие';
			|en = 'Consent application'"),
		Перечисления.СодержимоеДокументов.НеСодержитЗарплаты,
		,
		,
		,
		Перечисления.ВариантыПодписанияДокументовКЭДО.НеобходимаСобственноручнаяПодпись);
	
	ЭлектронныеТрудовыеКнижки.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	УчетНДФЛДокументы.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	КадровыйУчет.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	УчетПособийСоциальногоСтрахования.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ЗарплатаКадрыДляНебольшихОрганизаций") Тогда
		МодульЗарплатаКадрыДляНебольшихОрганизаций = ОбщегоНазначения.ОбщийМодуль("ЗарплатаКадрыДляНебольшихОрганизаций");
		МодульЗарплатаКадрыДляНебольшихОрганизаций.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	КонецЕсли;
	
	БизнесПроцессыЗаявокСотрудников.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	ЗаявкиСотрудников.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	
КонецПроцедуры

Процедура ДокументКадровогоЭДОФормаСпискаПриСозданииНаСервере(УправляемаяФорма, Отказ, СтандартнаяОбработка) Экспорт
	
	ТекстЗапроса = УправляемаяФорма.Список.ТекстЗапроса;
	ПозицияСкобки = СтрНайти(ТекстЗапроса, "}", НаправлениеПоиска.СКонца);
	Если ПозицияСкобки > 0 Тогда
		ТекстЗапроса = Лев(ТекстЗапроса, ПозицияСкобки - 1);
		ТекстЗапроса = ТекстЗапроса + ",
			|	(ИСТИНА В
			|		(ВЫБРАТЬ ПЕРВЫЕ 1
			|			ИСТИНА
			|		ИЗ
			|			РегистрСведений.СоставДокументовЗарплатаКадры КАК СоставДокументовЗарплатаКадры
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудниковИнтервальный КАК КадроваяИсторияСотрудниковИнтервальный
			|				ПО
			|					СоставДокументовЗарплатаКадры.ФизическоеЛицо = КадроваяИсторияСотрудниковИнтервальный.ФизическоеЛицо
			|		ГДЕ
			|			КадроваяИсторияСотрудниковИнтервальный.Подразделение В ИЕРАРХИИ (&Подразделение)
			|			И ДокументДокументКадровогоЭДО.Дата МЕЖДУ КадроваяИсторияСотрудниковИнтервальный.ДатаНачала И КадроваяИсторияСотрудниковИнтервальный.ДатаОкончания
			|			И ДокументДокументКадровогоЭДО.Ссылка = СоставДокументовЗарплатаКадры.ДокументФизическогоЛица))}";
		УправляемаяФорма.Список.ТекстЗапроса = ТекстЗапроса;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
